// import { IWord, TTeg } from '@/interfaces/api.interface';

// export const demoTegsList: TTeg = [
//   'сленг',
//   'мода',
//   'Пацанские',
//   'Культура',
//   'Игры',
//   'IT',
//   'Новые',
//   'сленг',
//   'мода',
//   'Пацанские',
//   'Культура',
//   'Игры',
//   'IT',
//   'Новые',
// ];

// export const demoWordsList: Array<IWord> = [
//   {
//     word: 'Килиманджарит',
//     description: 'Состоянии безумной эйфории, неописуемого кайфа',
//     tegs: ['Сленг', 'Модное'],
//     author: 'DarkPussyEater228',
//     speech: 'Прилагательное',
//     example: [
//       '- Брат когда вижу пейзаж родного аула меня жестко килиманджари',
//       'Наступило лето, солнце стучит в окно, тем самым килиманджарит мою душу',
//     ],
//     likes: 131,
//   },
//   {
//     word: 'Килиманджарит_1',
//     description: 'Состоянии безумной эйфории, неописуемого кайфа',
//     tegs: ['Сленг', 'Модное'],
//     author: 'DarkPussyEater228',
//     speech: 'Прилагательное',
//     example: [
//       '- Брат когда вижу пейзаж родного аула меня жестко килиманджари',
//       'Наступило лето, солнце стучит в окно, тем самым килиманджарит мою душу',
//     ],
//     likes: 131,
//   },
//   {
//     word: 'Килиманджарит_2',
//     description: 'Состоянии безумной эйфории, неописуемого кайфа',
//     tegs: ['Сленг', 'Модное'],
//     author: 'DarkPussyEater228',
//     speech: 'Прилагательное',
//     example: [
//       '- Брат когда вижу пейзаж родного аула меня жестко килиманджари',
//       'Наступило лето, солнце стучит в окно, тем самым килиманджарит мою душу',
//     ],
//     likes: 131,
//   },
//   {
//     word: 'Килиманджарит_3',
//     description: 'Состоянии безумной эйфории, неописуемого кайфа',
//     tegs: ['Сленг', 'Модное'],
//     author: 'DarkPussyEater228',
//     speech: 'Прилагательное',
//     example: [
//       '- Брат когда вижу пейзаж родного аула меня жестко килиманджари',
//       'Наступило лето, солнце стучит в окно, тем самым килиманджарит мою душу',
//     ],
//     likes: 131,
//   },
//   {
//     word: 'Килиманджарит_4',
//     description: 'Состоянии безумной эйфории, неописуемого кайфа',
//     tegs: ['Сленг', 'Модное'],
//     author: 'DarkPussyEater228',
//     speech: 'Прилагательное',
//     example: [
//       '- Брат когда вижу пейзаж родного аула меня жестко килиманджари',
//       'Наступило лето, солнце стучит в окно, тем самым килиманджарит мою душу',
//     ],
//     likes: 131,
//   },
//   {
//     word: 'Килиманджарит_5',
//     description: 'Состоянии безумной эйфории, неописуемого кайфа',
//     tegs: ['Сленг', 'Модное'],
//     author: 'DarkPussyEater228',
//     speech: 'Прилагательное',
//     example: [
//       '- Брат когда вижу пейзаж родного аула меня жестко килиманджари',
//       'Наступило лето, солнце стучит в окно, тем самым килиманджарит мою душу',
//     ],
//     likes: 131,
//   },
// ];
